Revit 2026 API

# ICodeCheckingParameterServer Interface

---

Interface for the code checking parameter server to implement.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface ICodeCheckingParameterServer : IExternalServer
```
```vb
Public Interface ICodeCheckingParameterServer
	Inherits IExternalServer
```
```cpp
public interface class ICodeCheckingParameterServer : IExternalServer
```
```fsharp
type ICodeCheckingParameterServer =
    interface
        interface IExternalServer
    end
```

The ICodeCheckingParameterServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | PerformCodeChecking | The server's method that will be called when Revit User clicks the Code Checking parameter's button from the properties palette. |

#### Reference

Autodesk.Revit.DB.Structure Namespace